<script>
  import FaqItemsList from './FaqItemsList.svelte'

  export let title = 'ОСТАЛИСЬ ВОПРОСЫ?'
  export let imageUrl = 'src/assets/svg/discover-draw.svg'
  export let items = [
    {
      title:
        'Как воспользоваться вашим сервисом и установить Social CRM на свой компьютер?',
      description:
        'Установить сервис Social CRM вы сможете из раздела «Установка» на сайте компании.',
    },
    {
      title: 'Как оплатить сервис Social CRM?',
      description:
        'Выбрать удобный для вас тариф и оплатить его вы сможете в разделе "Оплата" на сайте нашей компании.',
    },
    {
      title: 'Как долго придётся изучать crm-систему?',
      description:
        'Это также легко, как разобраться в вашем телефоне. Интерфейс сервиса Social CRM настолько интуитивно прост и доступен для понимания, что функционал системы можно освоить буквально за пару часов.',
    },
    {
      title:
        'Какие гарантии, что я получу ожидаемый результат от работы сервиса Social CRM?',
      description:
        'Нашей компанией был осуществлён серьёзный мониторинг на эффективность работы нашего сервиса более чем в 80 странах на протяжении 3 лет. Отрицательный результат возможен только в двух случаях, - неправильное использование сервиса или полное отсутствие вашей деятельности.',
    },
    {
      title: 'Способствует ли сервис увеличению потока клиентов?',
      description:
        'Сервис Social CRM не работает самостоятельно, без вашего участия. Но за счёт автоматизации многих рутинных бизнес-процессов и внедрения систематизации ваших действий, поток клиентов будет безусловно увеличиваться.',
    },
    {
      title: 'Можно ли работать с нескольких аккаунтов в соцсетях?',
      description:
        'Сервис Social CRM по сути является расширением к браузеру Google Chrome и привязан к тому аккаунту, с которого вы работаете на текущий момент времени. Таким образом, вы можете работать с любого аккаунта, но не одновременно с нескольких.',
    },
    {
      title: 'Можно ли работать одновременно с нескольких устройств?',
      description:
        'Social CRM предназначен для индивидуальной работы одного человека. Вы можете работать с любого компьютера, ноутбука или макбука, но корректную работу можно гарантировать при работе на одном из выбранных вами устройств.',
    },
    {
      title: 'Можно ли работать в CRM системе с телефона или планшета?',
      description:
        'Пока наш сервис функционирует только в браузере Google Chrome. О появление мобильной версии Social CRM вы будете оповещены.',
    },
    {
      title:
        'Можно ли отслеживать работу своих сотрудников, занимающихся продажами?',
      description:
        'Только в случае, если у вас есть данные для доступа к их срм-системам.',
    },
    {
      title: 'Можно ли сменить язык интерфейса?',
      description:
        'Да, в настройках сервиса вы можете переключиться на один из четырёх, размещенных там языков.',
    },
    {
      title:
        'Возможно ли групповое подключение вашего сервиса и как это отразится на его цене?',
      description:
        'У нас предусмотрена работа с корпоративными клиентами по специальным ценам. На сайте компании в разделе «Оплата» вы можете подробно ознакомиться с условиями приобретения пакетных услуг с разным количеством лицензий Social CRM.',
    },
    {
      title: 'Как пройти обучение по работе с сервисом?',
      description:
        'Всю информацию по функционалу и работе с воронкой продаж вы найдете на сайте компании в разделе «Обучение». Индивидуальный курс предусмотрен для корпоративных клиентов или при дополнительной оплате обучения нашему сертифицированному интегратору.',
    },
    {
      title: 'Можно ли работать в нескольких соцсетях?',
      description:
        'Наш сервис работает в 5-ти соцсетях и 3-х мессенджерах. Переключаться между ними вы сможете через иконку Social CRM в правом верхнем углу браузера.',
    },
    {
      title: 'Можно ли осуществлять через сервис массовую рассылку?',
      description:
        'Мы также, как и социальные сети, не приветствуем СПАМ рассылку. В альтернативу предлагаем вам более эффективный алгоритм взаимодействия с вашими потенциальными клиентами, с которым рекомендуем ознакомиться в разделе «Обучение» на сайте нашей компании.',
    },
    {
      title: 'Есть ли какие-то ограничения по рассылке писем своим клиентам?',
      description:
        'Мы не нарушаем установленных соцсетями правил и руководствуемся ими. В каждой соцсети есть свои правила ведения переписки и установленные ими лимиты. Подробную информацию о лимитах различных соцсетей вы можете получить в разделе "Обучение" на сайте нашей компании.',
    },
    {
      title:
        'Что делать, если обнаружен баг или какой-то сбой в работе плагина?',
      description:
        'В этом случае вам необходимо связаться с нашим специалистом из службы поддержки. Мы будем благодарны за своевременное оповещение о найденной ошибке! Сделать это вы можете с нашего сайта либо в одной из наших групп в соцсетях.',
    },
    {
      title:
        'Можно ли зарабатывать на партнерской программе, рекомендуя сервис?',
      description:
        'За каждую рекомендацию нашего сервиса вы будете получать на внутренний кошелёк 20% от оплаченного тарифа приглашенного, без возможности вывода этих средств на карту. Накопленными средствами Вы можете рассчитываться за очередной период доступа к сервису Social CRM. Таким образом, предоставив возможности нашего сервиса пятерым своим партнерам по бизнесу, вы сами сможете использовать его без последующей оплаты! Партнерская программа предусмотрена для наших сертифицированных интеграторов системы Social CRM. Подробную информацию по возможностям сотрудничества с нашей компанией вы можете получить, обратившись к специалисту службы поддержки.',
    },
  ]
</script>

<section class="faq">
  <div class="faq__wrapper container">
    <h2 class="faq__title">{@html title}</h2>
    <div class="faq__content d-flex justify-content-center">
      <FaqItemsList {items} />
      {#if imageUrl}
        <div class="faq__image-wrapper hide-for-mobile">
          <img class="faq__image" src={imageUrl} alt="" />
        </div>
      {/if}
    </div>
  </div>
</section>

<style lang="scss" global>
  @import './Faq.scss';
</style>
