<script>
  import WhyItemsList from './WhyItemsList.svelte'

  export let title = 'ПОЧЕМУ КЛИЕНТЫ ВЫБИРАЮТ ИМЕННО НАС'
  export let items = [
    {
      title: 'ТЩАТЕЛЬНЫЙ АНАЛИЗ КАЖДОГО БЛОГЕРА',
      description:
        'Мы проверяем каждого блогера через несколько авторитетных сервисов, а также вручную запрашиваем и проверяем скриншоты с их статистикой',
      imageUrl: 'src/assets/svg/segment-analysis.svg',
    },
    {
      title: 'ВХОДЯЩИЕ ЗАЯВКИ ОТ БЛОГЕРОВ НА ПОТОКЕ',
      description:
        'Создавай и публикуй предложения, а мы покажем их тысячам блогеров которые смогут оставлять заявки на бартер с тобой, это сэкономит время на подбор минимум в 10 раз',
    },
    {
      title: 'БЫСТРЫЙ И УДОБНЫЙ ПОИСК ПО БАЗЕ',
      description:
        'Благодаря тому что мы предоставляем удобные фильтры, всю необходимую статистику, рейтинг качества аккаунта, отзывы и кейсы других бизнесов, вы сможете быстро подобрать подходящих блогеров',
    },
    {
      title: 'ВЗАИМОДЕЙСТВИЯ С КАЖДЫМ БЛОГЕРОМ КАК НА ЛАДОНИ',
      description:
        'Вы будете видеть и получать уведомления о прохождение каждого этапа сотрудничества с каждым блогером от заявки до предоставления отчета о результатах',
    },
    {
      title: 'ВСЕ КОММУНИКАЦИИ ВО ВСТРОЕННОМ ЧАТЕ',
      description:
        'Проблемы с поиском чатов с блогерами среди прочих чатов больше не будет, теперь вы сможете обсуждать все детали сотрудничества в отдельном чате на платформе',
    },
    {
      title: 'ПОДРОБНЫЕ ОТЧЕТЫ О РЕЗУЛЬТАТАХ',
      description:
        'Анализируй результаты каждого блогера после сделанной им рекламы и оценивай эффективность и окупаемость',
    },
    {
      title: 'УДОБНАЯ СИСТЕМА СБОРА ЗАЯВОК',
      description:
        'Получай заявки от клиентов прямо в приложение, а также другие удобные сервисы для работы с клиентами (YClients или amoCRM)',
      imageUrl: 'src/assets/svg/detailed-analysis.svg',
    },
  ]
</script>

<section class="why">
  <div class="why__wrapper container">
    <h2 class="why__title">{title}</h2>
    <div class="why__content">
      <WhyItemsList class="why__items-wrapper row" {items} />
    </div>
  </div>
</section>

<style lang="scss" global>
  @import './Why.scss';
</style>
