<script>
  import ReviewsItemsList from './ReviewsItemsList.svelte'

  export let id
  export let title = 'о нас говорят'
  export let items = [
    {
      title: 'Рыбатекст используется дизайнерами, проектировщиками.',
      description:
        'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты или прототипы содержимым. Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты или прототипы содержимым',
    },
    {
      title: 'Рыбатекст используется дизайнерами, проектировщиками.',
      description:
        'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты или прототипы содержимым. Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты или прототипы содержимым',
    },
    {
      title: 'Рыбатекст используется дизайнерами, проектировщиками.',
      description:
        'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты или прототипы содержимым. Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты или прототипы содержимым',
    },
  ]
</script>

<section {id} class="reviews">
  <div class="reviews__wrapper container">
    <h2 class="reviews__title">{@html title}</h2>
    <div class="reviews__content d-flex justify-content-center">
      <ReviewsItemsList {items} />
    </div>
  </div>
</section>

<style lang="scss" global>
  @import './Reviews.scss';
</style>
